from argparse import Namespace
from django.urls import path

from . views import 근로자_목록,근로장_업데이트,근로장_상세, 근로장_목록, 근로장_등록, 근로장_삭제, 근로자_등록, 근로자_업데이트, 근로자_삭제, 근로자_상세

app_name = "MonitorningAPP"


urlpatterns = [
    path('',근로장_목록,name="근로장_목록"),
    path('<int:pk>/',근로자_상세,name='상세'),   #근로자 상세
    path('<int:pk>/업데이트/',근로장_업데이트,name='업뎃'),  #근로장_목록/1/업데이트 -> 근로자 업데이트
    path('<int:pk>/삭제/',근로장_삭제,name='삭제'),  #근로장_목록/1/삭제-> 근로자 삭제
    path('근로장_등록/',근로장_등록,name="근로장_등록"),  #근로자 등록


    path('근로자_목록/',근로자_목록,name="근로자_목록"),   #근로자 
    path('근로자_등록/',근로자_등록,name="근로자_등록"),   #근로자 
    path('근로자_목록/근로자_업데이트/<int:pk>/',근로자_업데이트,name="근로자업뎃"),  #근로장_목록/1/업데이트 -> 근로자 업데이트
    path('근로자_목록/근로자_삭제/<int:pk>/',근로자_삭제,name='근로자_삭제'),  #근로장_목록/1/삭제-> 근로자 삭제

    # path('근로자_목록/근로자_상세/<int:pk>/',근로자_상세,name='근로자_상세'),  #근로장_목록/1/삭제-> 근로자 삭제


















    



    # path('근로장_등록/',근로장_등록,name="근로장_등록"),   #근로장 등록
    # path('<int:pk>/근로장_삭제/',근로장_삭제,name="근로장_삭제"),   #근로장 삭제





]